app/controllers/pages_controller.rb

  def index
    @tasks = Task.all

    @my_tasks = Task.all.order('end_date ASC').select do |task|
      task.user_id == (current_user&.id)
    end

    @not_finished_tasks = @my_tasks.select do |task|
---
SELECT "tasks".* FROM "tasks" ORDER BY updated_at DESC
SELECT SUM() FROM "tasks"