app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save!
---
INSERT INTO "tasks" ("created_at", "updated_at", "title", "content", "start_date", "end_date", "todo", "difficulty", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "end_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2022-12-17 03:27:04.875665"], ["end_date", "2022-12-20"], ["id", 262]]

  def destroy
    @task = Task.find(params[:id])
    if @task.destroy!
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 95]]